# MepPipeUpperObvertElevation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MepPipeUpperObvertElevation Property
ParameterTypeId Class See Also
---
"Upper End Obvert Elevation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MepPipeUpperObvertElevation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MepPipeUpperObvertElevation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MepPipeUpperObvertElevation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace